ruby/H.org
#+TITLE:     H
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 3
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
 #+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: <a href="#bottom">⇩</a>
#+HTML: <a id="top"/>
#+HTML: </div>


* [[https://wordsinasentence.com/hackneyed-in-a-sentence/][Hackneyed]]

  =repeated too often; overused=

  - Too often used by young girls, the word “like” has become hackneyed.
  - Every time my internet goes down, the cable company gives me a hackneyed explanation.
  - Although I like him as a talk show host, his hackneyed *catchphrase* =口头禅= is starting to get on my nerves!
  - The *impersonator’s* performance was made worse by his hackneyed impressions.
  - Since dyeing your hair purple has become a hackneyed style, I am dyeing my hair green!
  - When it comes to writing, teachers frown against students using hackneyed phrases.
  - “A hackneyed version of her previous works” is how the critics described the author’s new novel.



* [[https://wordsinasentence.com/haggle-in-a-sentence/][Haggle]]

  =to engage in conversation to reach a deal=

  - To get a good bargain, Jake will haggle with the flea market vendors.
  - The car dealership advertises itself as a “no haggle” business where a customer does not have to argue for a great deal.
  - During the investment meeting, the company CEO and the potential investor will haggle over the value of the organization.
  - I’ll pay the *sticker price* =标价= because I do not want to haggle with the trader.



* [[https://wordsinasentence.com/hamper-in-a-sentence/][Hamper]]

  =to delay progress=

  - This awful traffic is definitely going to hamper our trip to the beach.
  - According to economists, the high rate of unemployment will continue to hamper economic growth.
  - The stormy weather will hamper rescue efforts in the mountains.
  - In her notes, the mediator wrote how the lack of communication seemed to hamper the creation of a settlement.
  - The school district’s severe budget cuts may hamper the flow of education in our schools.
  - Even though I would like to fly to Paris with my friends, my lack of funds is going to hamper my journey.
  - Your heavy costume is sure to hamper your movements.



* [[https://wordsinasentence.com/haphazard-in-a-sentence/][Haphazard]]

  =random, chaotic, incomplete=

  - Compared to her mother’s organized system, Jen’s approach to housekeeping was haphazard, at best.
  - The haphazard arrangement of different types of flowers created a surprisingly beautiful bouquet.
  - Because of the haphazard mixture of fabric pieces and the way they’re laid out, they call this a crazy quilt.
  - Steven’s notes were a haphazard jumble of thoughts and I couldn’t make any sense out of them.
  - Her haphazard method of arranging the furniture made the den look cluttered and somewhat disturbing.
  - While her life had been characterized by a series of haphazard events, Cynthia somehow managed to develop into a very organized, structured businesswoman.
  - If you notice haphazard circles on the surface of the ocean, keep watching because it means whales have been jumping in the area.



