ruby/H.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-06-14 Thu 17:31 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>H</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">H</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc1a0d92">1. Hackneyed</a></li>
<li><a href="#orgac70d36">2. Haggle</a></li>
<li><a href="#orgbfb0d90">3. Hamper</a></li>
<li><a href="#org7d5417a">4. Haphazard</a></li>
<li><a href="#org365a7b3">5. Hatch</a></li>
<li><a href="#orgad8da2c">6. Haughty</a></li>
<li><a href="#org05e2555">7. Hearten</a></li>
<li><a href="#org690090b">8. Heartfelt</a></li>
<li><a href="#org12de1ea">9. Hedonist</a></li>
<li><a href="#orgb1668ef">10. Heed</a></li>
<li><a href="#org6ed6141">11. Heinous</a></li>
<li><a href="#org9290de5">12. Herald</a></li>
<li><a href="#orgc2dcf20">13. Herbaceous</a></li>
<li><a href="#org24ba269">14. Heterodox</a></li>
<li><a href="#orgacca939">15. Hiatus</a></li>
<li><a href="#org36efa4f">16. Hieroglyphic</a></li>
<li><a href="#org50db3e5">17. Hilarity</a></li>
<li><a href="#org53e48a4">18. Histrionic</a></li>
<li><a href="#org0a9a881">19. Hitherto</a></li>
<li><a href="#orgcc13939">20. Hospitable</a></li>
<li><a href="#org8ba7eaa">21. Hostile</a></li>
<li><a href="#org86b8147">22. Huddle</a></li>
<li><a href="#orgc8931e7">23. Humdrum</a></li>
<li><a href="#org69a46f9">24. Hurl</a></li>
<li><a href="#org7f26cbe">25. Hyperbole</a></li>
<li><a href="#org714f338">26. Hypnotic</a></li>
<li><a href="#org02e7a08">27. Hypochondriac</a></li>
<li><a href="#orgc81371d">28. Haggard</a></li>
<li><a href="#org5ecaba8">29. Halcyon</a></li>
<li><a href="#orgd066f1d">30. Hanker</a></li>
<li><a href="#org9dc4567">31. Hankering</a></li>
<li><a href="#org40aa434">32. Harangue</a></li>
<li><a href="#orga90314a">33. Harbinger</a></li>
<li><a href="#orge803b35">34. Hardihood</a></li>
<li><a href="#org8377412">35. Hardy</a></li>
<li><a href="#orgfc5effa">36. Harness</a></li>
<li><a href="#org549c360">37. Harrow</a></li>
<li><a href="#orgf126433">38. Hasten</a></li>
<li><a href="#org79cfc59">39. Hasty</a></li>
<li><a href="#orgd454445">40. Hazy</a></li>
<li><a href="#orgfffd03e">41. Headlong</a></li>
<li><a href="#org08fa41c">42. Headway</a></li>
<li><a href="#orga9f3dd1">43. Heady</a></li>
<li><a href="#org8cec33b">44. Hearken</a></li>
<li><a href="#org7c974f3">45. Hearsay</a></li>
<li><a href="#org410f0bb">46. Heave</a></li>
<li><a href="#org288eb88">47. Heckle</a></li>
<li><a href="#org9f707da">48. Hectic</a></li>
<li><a href="#orgb173700">49. Hedge</a></li>
<li><a href="#org400a284">50. Hermetic</a></li>
<li><a href="#orgbee8969">51. Hew</a></li>
<li><a href="#org0612ccf">52. Hidebound</a></li>
<li><a href="#org3203bd7">53. Hinder</a></li>
<li><a href="#org743fb4c">54. Hoarse</a></li>
<li><a href="#org472233c">55. Hoary</a></li>
<li><a href="#orgbd8d7da">56. Hoax</a></li>
<li><a href="#org94b7d2a">57. Hoist</a></li>
<li><a href="#orgf4ded4f">58. Homage</a></li>
<li><a href="#org252f7f4">59. Homely</a></li>
<li><a href="#org9dca9d1">60. Hone</a></li>
<li><a href="#org5fd1c14">61. Hoodwink</a></li>
<li><a href="#org4739f97">62. Horrendous</a></li>
<li><a href="#org33435d3">63. Horticulture</a></li>
<li><a href="#org02b2ddb">64. Hubris</a></li>
<li><a href="#org60acb16">65. Hue</a></li>
<li><a href="#orgb292541">66. Hurtle</a></li>
<li><a href="#org65a8229">67. Husbandry</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc1a0d92">1. Hackneyed</a></li>
<li><a href="#orgac70d36">2. Haggle</a></li>
<li><a href="#orgbfb0d90">3. Hamper</a></li>
<li><a href="#org7d5417a">4. Haphazard</a></li>
<li><a href="#org365a7b3">5. Hatch</a></li>
<li><a href="#orgad8da2c">6. Haughty</a></li>
<li><a href="#org05e2555">7. Hearten</a></li>
<li><a href="#org690090b">8. Heartfelt</a></li>
<li><a href="#org12de1ea">9. Hedonist</a></li>
<li><a href="#orgb1668ef">10. Heed</a></li>
<li><a href="#org6ed6141">11. Heinous</a></li>
<li><a href="#org9290de5">12. Herald</a></li>
<li><a href="#orgc2dcf20">13. Herbaceous</a></li>
<li><a href="#org24ba269">14. Heterodox</a></li>
<li><a href="#orgacca939">15. Hiatus</a></li>
<li><a href="#org36efa4f">16. Hieroglyphic</a></li>
<li><a href="#org50db3e5">17. Hilarity</a></li>
<li><a href="#org53e48a4">18. Histrionic</a></li>
<li><a href="#org0a9a881">19. Hitherto</a></li>
<li><a href="#orgcc13939">20. Hospitable</a></li>
<li><a href="#org8ba7eaa">21. Hostile</a></li>
<li><a href="#org86b8147">22. Huddle</a></li>
<li><a href="#orgc8931e7">23. Humdrum</a></li>
<li><a href="#org69a46f9">24. Hurl</a></li>
<li><a href="#org7f26cbe">25. Hyperbole</a></li>
<li><a href="#org714f338">26. Hypnotic</a></li>
<li><a href="#org02e7a08">27. Hypochondriac</a></li>
<li><a href="#orgc81371d">28. Haggard</a></li>
<li><a href="#org5ecaba8">29. Halcyon</a></li>
<li><a href="#orgd066f1d">30. Hanker</a></li>
<li><a href="#org9dc4567">31. Hankering</a></li>
<li><a href="#org40aa434">32. Harangue</a></li>
<li><a href="#orga90314a">33. Harbinger</a></li>
<li><a href="#orge803b35">34. Hardihood</a></li>
<li><a href="#org8377412">35. Hardy</a></li>
<li><a href="#orgfc5effa">36. Harness</a></li>
<li><a href="#org549c360">37. Harrow</a></li>
<li><a href="#orgf126433">38. Hasten</a></li>
<li><a href="#org79cfc59">39. Hasty</a></li>
<li><a href="#orgd454445">40. Hazy</a></li>
<li><a href="#orgfffd03e">41. Headlong</a></li>
<li><a href="#org08fa41c">42. Headway</a></li>
<li><a href="#orga9f3dd1">43. Heady</a></li>
<li><a href="#org8cec33b">44. Hearken</a></li>
<li><a href="#org7c974f3">45. Hearsay</a></li>
<li><a href="#org410f0bb">46. Heave</a></li>
<li><a href="#org288eb88">47. Heckle</a></li>
<li><a href="#org9f707da">48. Hectic</a></li>
<li><a href="#orgb173700">49. Hedge</a></li>
<li><a href="#org400a284">50. Hermetic</a></li>
<li><a href="#orgbee8969">51. Hew</a></li>
<li><a href="#org0612ccf">52. Hidebound</a></li>
<li><a href="#org3203bd7">53. Hinder</a></li>
<li><a href="#org743fb4c">54. Hoarse</a></li>
<li><a href="#org472233c">55. Hoary</a></li>
<li><a href="#orgbd8d7da">56. Hoax</a></li>
<li><a href="#org94b7d2a">57. Hoist</a></li>
<li><a href="#orgf4ded4f">58. Homage</a></li>
<li><a href="#org252f7f4">59. Homely</a></li>
<li><a href="#org9dca9d1">60. Hone</a></li>
<li><a href="#org5fd1c14">61. Hoodwink</a></li>
<li><a href="#org4739f97">62. Horrendous</a></li>
<li><a href="#org33435d3">63. Horticulture</a></li>
<li><a href="#org02b2ddb">64. Hubris</a></li>
<li><a href="#org60acb16">65. Hue</a></li>
<li><a href="#orgb292541">66. Hurtle</a></li>
<li><a href="#org65a8229">67. Husbandry</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Author</td>
<td class="org-left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="org-left">Date</td>
<td class="org-left">2018-06-14 17:31:54</td>
</tr>
</tbody>
</table>
<a href="#bottom">⇩</a>
<a id="top"/>
</div>


<div id="outline-container-orgc1a0d92" class="outline-2">
<h2 id="orgc1a0d92"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/hackneyed-in-a-sentence/">Hackneyed</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>repeated too often; overused</code>
</p>

<ul class="org-ul">
<li>Too often used by young girls, the word “like” has become hackneyed.</li>
<li>Every time my internet goes down, the cable company gives me a hackneyed explanation.</li>
<li>Although I like him as a talk show host, his hackneyed <b>catchphrase</b> <code>口头禅</code> is starting to get on my nerves!</li>
<li>The <b>impersonator’s</b> performance was made worse by his hackneyed impressions.</li>
<li>Since dyeing your hair purple has become a hackneyed style, I am dyeing my hair green!</li>
<li>When it comes to writing, teachers frown against students using hackneyed phrases.</li>
<li>“A hackneyed version of her previous works” is how the critics described the author’s new novel.</li>
</ul>
</div>
</div>



<div id="outline-container-orgac70d36" class="outline-2">
<h2 id="orgac70d36"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/haggle-in-a-sentence/">Haggle</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>to engage in conversation to reach a deal</code>
</p>

<ul class="org-ul">
<li>To get a good bargain, Jake will haggle with the flea market vendors.</li>
<li>The car dealership advertises itself as a “no haggle” business where a customer does not have to argue for a great deal.</li>
<li>During the investment meeting, the company CEO and the potential investor will haggle over the value of the organization.</li>
<li>I’ll pay the <b>sticker price</b> <code>标价</code> because I do not want to haggle with the trader.</li>
</ul>
</div>
</div>



<div id="outline-container-orgbfb0d90" class="outline-2">
<h2 id="orgbfb0d90"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/hamper-in-a-sentence/">Hamper</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>to delay progress</code>
</p>

<ul class="org-ul">
<li>This awful traffic is definitely going to hamper our trip to the beach.</li>
<li>According to economists, the high rate of unemployment will continue to hamper economic growth.</li>
<li>The stormy weather will hamper rescue efforts in the mountains.</li>
<li>In her notes, the mediator wrote how the lack of communication seemed to hamper the creation of a settlement.</li>
<li>The school district’s severe budget cuts may hamper the flow of education in our schools.</li>
<li>Even though I would like to fly to Paris with my friends, my lack of funds is going to hamper my journey.</li>
<li>Your heavy costume is sure to hamper your movements.</li>
</ul>
</div>
</div>



<div id="outline-container-org7d5417a" class="outline-2">
<h2 id="org7d5417a"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/haphazard-in-a-sentence/">Haphazard</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>random, chaotic, incomplete</code>
</p>

<ul class="org-ul">
<li>Compared to her mother’s organized system, Jen’s approach to housekeeping was haphazard, at best.</li>
<li>The haphazard arrangement of different types of flowers created a surprisingly beautiful bouquet.</li>
<li>Because of the haphazard mixture of fabric pieces and the way they’re laid out, they call this a crazy quilt.</li>
<li>Steven’s notes were a haphazard jumble of thoughts and I couldn’t make any sense out of them.</li>
<li>Her haphazard method of arranging the furniture made the den look cluttered and somewhat disturbing.</li>
<li>While her life had been characterized by a series of haphazard events, Cynthia somehow managed to develop into a very organized, structured businesswoman.</li>
<li>If you notice haphazard circles on the surface of the ocean, keep watching because it means whales have been jumping in the area.</li>
</ul>
</div>
</div>
