ruby/H.org
* [[https://wordsinasentence.com/hatch-in-a-sentence/][Hatch]]

  =a small opening in a wall, roof, or floor=

  - Ship workers opened the hatch and climbed down into the cargo hold area.
  - The hatch in the floor led to a damp basement.
  - As the fire raged, the homeowners escaped through a hatch in the roof.
  - A small hatch in the library wall led to a secret room.



* [[https://wordsinasentence.com/haughty-in-a-sentence/][Haughty]]

  =proud and unfriendly=

  - Because she was not nice, the haughty girl had few friends.
  - The principal at my school is haughty and considers herself to be above everyone else.
  - When the haughty CEO ignored the stockholders at the annual conference, the board of directors gave him a stern lecture.
  - Everyone likes Jenna because she is down-to-earth and not haughty.
  - Beneath Cathy’s haughty appearance, the psychiatrist saw a scared little girl who simply wanted to be loved.
  - The diva’s distant and haughty behavior made people forget just how talented she was.
  - In order to be a great waitress, you should be humble and not haughty.



* [[https://wordsinasentence.com/hearten-in-a-sentence/][Hearten]]

  =to encourage; give strength=

  - I tried to hearten my depressed classmate with encouraging words.
  - The pastor’s sermon seemed to hearten those who were going through trials and tribulations.
  - There seemed to be no way to hearten the disappointed group of hikers after their trip was cancelled.
  - A homemade card could hearten my mother even on her darkest day.



* [[https://wordsinasentence.com/heartfelt-in-a-sentence/][Heartfelt]]

  =honestly meant; sincere=

  - The heartfelt card brought tears to my eyes.
  - Because the apology was heartfelt, I accepted it without hesitation.
  - The person who saved my life has my heartfelt thanks.
  - After winning the award, the actress expressed her heartfelt gratitude to her parents.



* [[https://wordsinasentence.com/hedonist-in-a-sentence/][Hedonist]]

  =one who believes the pursuit of pleasure is the most important thing in life=

  - My neighbor is a hedonist who likes to party all night.
  - While Janice was on the cruise ship, she lived the life of a hedonist and spent most of her days in search of pleasure.
  - Carol’s aunt is a hedonist who pursues her own pleasures outside of her marriage.
  - Because he is a hedonist, Henry never does anything which does not give him joy.
  - When the actor used drugs, he became a hedonist and refused to go on set unless his trailer was filled with booze and women.
  - My cousin Joyce is a hedonist who enjoys having fun so much she cannot keep a regular job.
  - Even though Alan makes jokes about being a hedonist, he has taken a religious vow to help those in need.



* [[https://wordsinasentence.com/heed-in-a-sentence/][Heed]]

  =to mind someone’s advice or suggestion=

  - My sister is always in need of cash because she is unwilling to heed my financial advice.
  - Since James is a swimming champion, it would do you well to heed his advice on refining your stroke.
  - John lost his entire life savings because he was too arrogant to heed my tips on the stock market.
  - If you have a weak stomach, take heed and do not watch the horror film because it has some really gruesome scenes.
  - The foolish boy suffered a great deal of pain when he chose not to heed the cautionary note on the electric fence.
  - When you are worried about something, you simply need to heed your inner voice and let it guide you.
  - The basketball player was ejected from the game when he did not heed the referee’s warning.



* [[https://wordsinasentence.com/heinous-in-a-sentence/][Heinous]]

  =hatefully or shockingly evil=

  - The criminal received the death penalty for his heinous crime.
  - When I forgot my wedding anniversary, my wife told me I had committed a heinous act.
  - The priest told the man that only God could forgive him for his heinous actions.
  - For the right amount, the *sleazy* lawyer will represent even the most heinous criminals.
  - Do you believe individuals who experienced troubled childhoods are more likely to commit heinous crimes than their counterparts who had healthy childhoods?
  - The president promised the public that the people who performed the heinous act of violence against the school children would be punished to the fullest extent of the law.
  - Even as the death row inmate prepared to take his final breath, he still refused to apologize for his heinous deeds.



* [[https://wordsinasentence.com/herald-in-a-sentence/][Herald]]

  =a messenger, especially one bringing important news=

  - Because he was always up-to-date on the latest information, we referred to our friend as a herald.
  - The herald was to announce the name of the new baby Prince later that afternoon.
  - The office herald came to everyone’s office to bring us news of the impending merger.
  - Our school herald delivered the announcements every morning.



* [[https://wordsinasentence.com/herbaceous-in-a-sentence/][Herbaceous]]

  =related to herbs any plant used for flavoring, food, medicine, or perfume=

  - The chef crafted an herbaceous *paste* =面团= and *spiked* the dish with a hint of mint and lemon.
  - With one bite of the sage-filled soup, the taste of the earthy dish overpowered my taste buds with its herbaceous wonder.
  - Herbaceous odors filled the kitchen as my mother cooked her signature dish using both basil and cilantro.
  - Herbaceous flavors were used in the medicine, helping the *aftertaste* =回味= be more plantlike rather than fishy.



* [[https://wordsinasentence.com/heterodox-in-a-sentence/][Heterodox]]

  =different from what is considered the norm=

  - The church will excommunicate anyone who preaches heterodox beliefs.
  - When the dictator took power, he ordered the death of anyone who held ideas heterodox to his own.
  - Many of the old professors did not like the heterodox teaching strategies proposed by their young colleague.
  - Whoever would have thought the heterodox coaching strategy would turn the worse team in the county into the state champions?



