ruby/H.html



<div id="outline-container-org365a7b3" class="outline-2">
<h2 id="org365a7b3"><span class="section-number-2">5</span> <a href="https://wordsinasentence.com/hatch-in-a-sentence/">Hatch</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<code>a small opening in a wall, roof, or floor</code>
</p>

<ul class="org-ul">
<li>Ship workers opened the hatch and climbed down into the cargo hold area.</li>
<li>The hatch in the floor led to a damp basement.</li>
<li>As the fire raged, the homeowners escaped through a hatch in the roof.</li>
<li>A small hatch in the library wall led to a secret room.</li>
</ul>
</div>
</div>



<div id="outline-container-orgad8da2c" class="outline-2">
<h2 id="orgad8da2c"><span class="section-number-2">6</span> <a href="https://wordsinasentence.com/haughty-in-a-sentence/">Haughty</a></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>proud and unfriendly</code>
</p>

<ul class="org-ul">
<li>Because she was not nice, the haughty girl had few friends.</li>
<li>The principal at my school is haughty and considers herself to be above everyone else.</li>
<li>When the haughty CEO ignored the stockholders at the annual conference, the board of directors gave him a stern lecture.</li>
<li>Everyone likes Jenna because she is down-to-earth and not haughty.</li>
<li>Beneath Cathy’s haughty appearance, the psychiatrist saw a scared little girl who simply wanted to be loved.</li>
<li>The diva’s distant and haughty behavior made people forget just how talented she was.</li>
<li>In order to be a great waitress, you should be humble and not haughty.</li>
</ul>
</div>
</div>



<div id="outline-container-org05e2555" class="outline-2">
<h2 id="org05e2555"><span class="section-number-2">7</span> <a href="https://wordsinasentence.com/hearten-in-a-sentence/">Hearten</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<code>to encourage; give strength</code>
</p>

<ul class="org-ul">
<li>I tried to hearten my depressed classmate with encouraging words.</li>
<li>The pastor’s sermon seemed to hearten those who were going through trials and tribulations.</li>
<li>There seemed to be no way to hearten the disappointed group of hikers after their trip was cancelled.</li>
<li>A homemade card could hearten my mother even on her darkest day.</li>
</ul>
</div>
</div>



<div id="outline-container-org690090b" class="outline-2">
<h2 id="org690090b"><span class="section-number-2">8</span> <a href="https://wordsinasentence.com/heartfelt-in-a-sentence/">Heartfelt</a></h2>
<div class="outline-text-2" id="text-8">
<p>
<code>honestly meant; sincere</code>
</p>

<ul class="org-ul">
<li>The heartfelt card brought tears to my eyes.</li>
<li>Because the apology was heartfelt, I accepted it without hesitation.</li>
<li>The person who saved my life has my heartfelt thanks.</li>
<li>After winning the award, the actress expressed her heartfelt gratitude to her parents.</li>
</ul>
</div>
</div>



<div id="outline-container-org12de1ea" class="outline-2">
<h2 id="org12de1ea"><span class="section-number-2">9</span> <a href="https://wordsinasentence.com/hedonist-in-a-sentence/">Hedonist</a></h2>
<div class="outline-text-2" id="text-9">
<p>
<code>one who believes the pursuit of pleasure is the most important thing in life</code>
</p>

<ul class="org-ul">
<li>My neighbor is a hedonist who likes to party all night.</li>
<li>While Janice was on the cruise ship, she lived the life of a hedonist and spent most of her days in search of pleasure.</li>
<li>Carol’s aunt is a hedonist who pursues her own pleasures outside of her marriage.</li>
<li>Because he is a hedonist, Henry never does anything which does not give him joy.</li>
<li>When the actor used drugs, he became a hedonist and refused to go on set unless his trailer was filled with booze and women.</li>
<li>My cousin Joyce is a hedonist who enjoys having fun so much she cannot keep a regular job.</li>
<li>Even though Alan makes jokes about being a hedonist, he has taken a religious vow to help those in need.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb1668ef" class="outline-2">
<h2 id="orgb1668ef"><span class="section-number-2">10</span> <a href="https://wordsinasentence.com/heed-in-a-sentence/">Heed</a></h2>
<div class="outline-text-2" id="text-10">
<p>
<code>to mind someone’s advice or suggestion</code>
</p>

<ul class="org-ul">
<li>My sister is always in need of cash because she is unwilling to heed my financial advice.</li>
<li>Since James is a swimming champion, it would do you well to heed his advice on refining your stroke.</li>
<li>John lost his entire life savings because he was too arrogant to heed my tips on the stock market.</li>
<li>If you have a weak stomach, take heed and do not watch the horror film because it has some really gruesome scenes.</li>
<li>The foolish boy suffered a great deal of pain when he chose not to heed the cautionary note on the electric fence.</li>
<li>When you are worried about something, you simply need to heed your inner voice and let it guide you.</li>
<li>The basketball player was ejected from the game when he did not heed the referee’s warning.</li>
</ul>
</div>
</div>



<div id="outline-container-org6ed6141" class="outline-2">
<h2 id="org6ed6141"><span class="section-number-2">11</span> <a href="https://wordsinasentence.com/heinous-in-a-sentence/">Heinous</a></h2>
<div class="outline-text-2" id="text-11">
<p>
<code>hatefully or shockingly evil</code>
</p>

<ul class="org-ul">
<li>The criminal received the death penalty for his heinous crime.</li>
<li>When I forgot my wedding anniversary, my wife told me I had committed a heinous act.</li>
<li>The priest told the man that only God could forgive him for his heinous actions.</li>
<li>For the right amount, the <b>sleazy</b> lawyer will represent even the most heinous criminals.</li>
<li>Do you believe individuals who experienced troubled childhoods are more likely to commit heinous crimes than their counterparts who had healthy childhoods?</li>
<li>The president promised the public that the people who performed the heinous act of violence against the school children would be punished to the fullest extent of the law.</li>
<li>Even as the death row inmate prepared to take his final breath, he still refused to apologize for his heinous deeds.</li>
</ul>
</div>
</div>



<div id="outline-container-org9290de5" class="outline-2">
<h2 id="org9290de5"><span class="section-number-2">12</span> <a href="https://wordsinasentence.com/herald-in-a-sentence/">Herald</a></h2>
<div class="outline-text-2" id="text-12">
<p>
<code>a messenger, especially one bringing important news</code>
</p>

<ul class="org-ul">
<li>Because he was always up-to-date on the latest information, we referred to our friend as a herald.</li>
<li>The herald was to announce the name of the new baby Prince later that afternoon.</li>
<li>The office herald came to everyone’s office to bring us news of the impending merger.</li>
<li>Our school herald delivered the announcements every morning.</li>
</ul>
</div>
</div>



<div id="outline-container-orgc2dcf20" class="outline-2">
<h2 id="orgc2dcf20"><span class="section-number-2">13</span> <a href="https://wordsinasentence.com/herbaceous-in-a-sentence/">Herbaceous</a></h2>
<div class="outline-text-2" id="text-13">
<p>
<code>related to herbs any plant used for flavoring, food, medicine, or perfume</code>
</p>

<ul class="org-ul">
<li>The chef crafted an herbaceous <b>paste</b> <code>面团</code> and <b>spiked</b> the dish with a hint of mint and lemon.</li>
<li>With one bite of the sage-filled soup, the taste of the earthy dish overpowered my taste buds with its herbaceous wonder.</li>
<li>Herbaceous odors filled the kitchen as my mother cooked her signature dish using both basil and cilantro.</li>
<li>Herbaceous flavors were used in the medicine, helping the <b>aftertaste</b> <code>回味</code> be more plantlike rather than fishy.</li>
</ul>
</div>
</div>



<div id="outline-container-org24ba269" class="outline-2">
<h2 id="org24ba269"><span class="section-number-2">14</span> <a href="https://wordsinasentence.com/heterodox-in-a-sentence/">Heterodox</a></h2>
<div class="outline-text-2" id="text-14">
<p>
<code>different from what is considered the norm</code>
</p>

<ul class="org-ul">
<li>The church will excommunicate anyone who preaches heterodox beliefs.</li>
<li>When the dictator took power, he ordered the death of anyone who held ideas heterodox to his own.</li>
<li>Many of the old professors did not like the heterodox teaching strategies proposed by their young colleague.</li>
<li>Whoever would have thought the heterodox coaching strategy would turn the worse team in the county into the state champions?</li>
</ul>
</div>
</div>
