ruby/H.org
* [[https://wordsinasentence.com/hiatus-in-a-sentence/][Hiatus]]

  =a period of time when something is stopped=

  - After Mary had a baby, she took a brief hiatus from work.
  - The professor will take his family on a long vacation during his hiatus.
  - Although the singer took a two-year hiatus from touring, she has not lost her ability to entertain a crowd.
  - My doctor suggests I take a hiatus from my job while I am recovering from knee surgery.
  - While my husband is stationed overseas in an isolated area, our nightly phone chats will be on a temporary hiatus.
  - When the school reopens after the holiday hiatus, the entire building will have been repainted.
  - My boss gave me a paid hiatus after I closed a huge deal.



* [[https://wordsinasentence.com/hieroglyphic-in-a-sentence/][Hieroglyphic]]

  =writing that is done in hieroglyphics=

  - The writings of the ancient Egyptians was almost entirely hieroglyphic, based on pictures and drawings.
  - Hieroglyphic languages do not use written letters like we are used to, but pictures and drawn images.
  - The cave paintings of ancient cavemen could be considered hieroglyphic since they are based on imagery.
  - Hieroglyphic writing is based on visual drawings and pictures instead of a written language like most are used to.



* [[https://wordsinasentence.com/hilarity-in-a-sentence/][Hilarity]]

  =loud laughter or fun=

  - The hilarity of the comedy show was interrupted by a brawl in the audience.
  - Since the movie is supposed to be a really funny comedy, my friend and I are expecting a night of hilarity.
  - The comedian was pleased when the audience responded with hilarity to his jokes.
  - Before going to bed each night, the children enjoy thirty minutes of hilarity by watching their favorite cartoon.



* [[https://wordsinasentence.com/histrionic-in-a-sentence/][Histrionic]]

  =over the top with emotional responses=

  - When John does not take his psychiatric medicine, he might have a histrionic outburst about the smallest of things.
  - The widow’s histrionic screaming made the detectives suspicious.
  - Whenever the spoiled toddler does not get her way, she begins to yell in a histrionic manner.
  - Everyone wanted to know why the actor performed the dramatic role in a histrionic way.



* [[https://wordsinasentence.com/hitherto-in-a-sentence/][Hitherto]]

  =up until this time or point=

  - Hitherto Jim got married and became a devoted spouse, his greatest pleasure had been *picking up women*.
  - Before John learned to fly an airplane, he had hitherto been afraid of heights.
  - Hitherto Carmelo was thought a suspect in his wife’s murder and forbidden to leave town.
  - When Candace moved out of her parents’ house, she began to enjoy all of the freedoms that hitherto had been denied her.



* [[https://wordsinasentence.com/hospitable-in-a-sentence/][Hospitable]]

  =welcoming and warm to visitors=

  - The hospitable host of the bed and breakfast opens the front door for each of her guests.
  - Because John was having a bad day, he was not very hospitable to his friends when they came to visit.
  - The hospitable doorman offered Ann a cold bottle of water as soon as she stepped out the door.
  - Although the restaurant does not have the best food, I go there often because the hospitable staff treats me like family.



* [[https://wordsinasentence.com/hostile-in-a-sentence/][Hostile]]

  =unfriendly; menacing=

  - When the police officer pointed the gun at me, he looked quite hostile.
  - April left her job because of the hostile work environment.
  - When I saw the hostile man approaching my car, I immediately locked my doors.
  - The hostile dog growled at me.



* [[https://wordsinasentence.com/huddle-in-a-sentence/][Huddle]]

  =to crowd together, typically for warmth or privacy=

  - A football team will often huddle together so they can discuss their game plan without the other team seeing or hearing it.
  - Penguins like to huddle together so they can share their body warmth in the cold wastelands of their home.
  - My two young children decided to huddle together when the lightning and thunder from the storm above our house frightened them.
  - The soccer team decided to huddle together at the end of the game and congratulate the coach and each other on their victory.



* [[https://wordsinasentence.com/humdrum-in-a-sentence/][Humdrum]]

  =without excitement or variety; boring=

  - An exciting vacation would give me time away from my humdrum job.
  - When I saw everyone sitting down at the humdrum event, I knew the evening was going to be boring.
  - With so many fights on the field, the game was far from humdrum.
  - Jack fell asleep during the professor’s humdrum speech.



* [[https://wordsinasentence.com/hurl-in-a-sentence/][Hurl]]

  =to fling or toss something powerfully=

  - When Sarah teased her little brother, he took the book in his hand and decided to hurl it at her breaking her nose.
  - Riots broke out in the city causing rioters to hurl *Molotov cocktails* =燃烧瓶= at the approaching police.
  - When people get mad at their computers, they will often think they want to hurl it out the window causing it to smash on the ground.
  - *Pitchers* will hurl the baseball at the *catchers* in a baseball game which will usually get *clocked* =测...的速度= at a 100 miles per hour.



* [[https://wordsinasentence.com/hyperbole-in-a-sentence/][Hyperbole]]

  =an extravagant exaggeration=

  - The main element of the product’s commercial was a hyperbole describing rapid weight loss.
  - Although what I said may sound like a hyperbole, it really is the truth.
  - The author used one hyperbole after another to get his point across to his readers.
  - Because Janice was a drama queen, she used a hyperbole in practically every sentence.
  - During the hurricane, it seemed as though the hyperbole, “raining cats and dogs”, was almost accurate.
  - It would be great if you could simply tell me the basic facts without including a hyperbole of any sort.
  - If the politician uses one more hyperbole in his speech, I will know he is exaggerating about all his claims.



