ruby/H.html



<div id="outline-container-orgacca939" class="outline-2">
<h2 id="orgacca939"><span class="section-number-2">15</span> <a href="https://wordsinasentence.com/hiatus-in-a-sentence/">Hiatus</a></h2>
<div class="outline-text-2" id="text-15">
<p>
<code>a period of time when something is stopped</code>
</p>

<ul class="org-ul">
<li>After Mary had a baby, she took a brief hiatus from work.</li>
<li>The professor will take his family on a long vacation during his hiatus.</li>
<li>Although the singer took a two-year hiatus from touring, she has not lost her ability to entertain a crowd.</li>
<li>My doctor suggests I take a hiatus from my job while I am recovering from knee surgery.</li>
<li>While my husband is stationed overseas in an isolated area, our nightly phone chats will be on a temporary hiatus.</li>
<li>When the school reopens after the holiday hiatus, the entire building will have been repainted.</li>
<li>My boss gave me a paid hiatus after I closed a huge deal.</li>
</ul>
</div>
</div>



<div id="outline-container-org36efa4f" class="outline-2">
<h2 id="org36efa4f"><span class="section-number-2">16</span> <a href="https://wordsinasentence.com/hieroglyphic-in-a-sentence/">Hieroglyphic</a></h2>
<div class="outline-text-2" id="text-16">
<p>
<code>writing that is done in hieroglyphics</code>
</p>

<ul class="org-ul">
<li>The writings of the ancient Egyptians was almost entirely hieroglyphic, based on pictures and drawings.</li>
<li>Hieroglyphic languages do not use written letters like we are used to, but pictures and drawn images.</li>
<li>The cave paintings of ancient cavemen could be considered hieroglyphic since they are based on imagery.</li>
<li>Hieroglyphic writing is based on visual drawings and pictures instead of a written language like most are used to.</li>
</ul>
</div>
</div>



<div id="outline-container-org50db3e5" class="outline-2">
<h2 id="org50db3e5"><span class="section-number-2">17</span> <a href="https://wordsinasentence.com/hilarity-in-a-sentence/">Hilarity</a></h2>
<div class="outline-text-2" id="text-17">
<p>
<code>loud laughter or fun</code>
</p>

<ul class="org-ul">
<li>The hilarity of the comedy show was interrupted by a brawl in the audience.</li>
<li>Since the movie is supposed to be a really funny comedy, my friend and I are expecting a night of hilarity.</li>
<li>The comedian was pleased when the audience responded with hilarity to his jokes.</li>
<li>Before going to bed each night, the children enjoy thirty minutes of hilarity by watching their favorite cartoon.</li>
</ul>
</div>
</div>



<div id="outline-container-org53e48a4" class="outline-2">
<h2 id="org53e48a4"><span class="section-number-2">18</span> <a href="https://wordsinasentence.com/histrionic-in-a-sentence/">Histrionic</a></h2>
<div class="outline-text-2" id="text-18">
<p>
<code>over the top with emotional responses</code>
</p>

<ul class="org-ul">
<li>When John does not take his psychiatric medicine, he might have a histrionic outburst about the smallest of things.</li>
<li>The widow’s histrionic screaming made the detectives suspicious.</li>
<li>Whenever the spoiled toddler does not get her way, she begins to yell in a histrionic manner.</li>
<li>Everyone wanted to know why the actor performed the dramatic role in a histrionic way.</li>
</ul>
</div>
</div>



<div id="outline-container-org0a9a881" class="outline-2">
<h2 id="org0a9a881"><span class="section-number-2">19</span> <a href="https://wordsinasentence.com/hitherto-in-a-sentence/">Hitherto</a></h2>
<div class="outline-text-2" id="text-19">
<p>
<code>up until this time or point</code>
</p>

<ul class="org-ul">
<li>Hitherto Jim got married and became a devoted spouse, his greatest pleasure had been <b>picking up women</b>.</li>
<li>Before John learned to fly an airplane, he had hitherto been afraid of heights.</li>
<li>Hitherto Carmelo was thought a suspect in his wife’s murder and forbidden to leave town.</li>
<li>When Candace moved out of her parents’ house, she began to enjoy all of the freedoms that hitherto had been denied her.</li>
</ul>
</div>
</div>



<div id="outline-container-orgcc13939" class="outline-2">
<h2 id="orgcc13939"><span class="section-number-2">20</span> <a href="https://wordsinasentence.com/hospitable-in-a-sentence/">Hospitable</a></h2>
<div class="outline-text-2" id="text-20">
<p>
<code>welcoming and warm to visitors</code>
</p>

<ul class="org-ul">
<li>The hospitable host of the bed and breakfast opens the front door for each of her guests.</li>
<li>Because John was having a bad day, he was not very hospitable to his friends when they came to visit.</li>
<li>The hospitable doorman offered Ann a cold bottle of water as soon as she stepped out the door.</li>
<li>Although the restaurant does not have the best food, I go there often because the hospitable staff treats me like family.</li>
</ul>
</div>
</div>



<div id="outline-container-org8ba7eaa" class="outline-2">
<h2 id="org8ba7eaa"><span class="section-number-2">21</span> <a href="https://wordsinasentence.com/hostile-in-a-sentence/">Hostile</a></h2>
<div class="outline-text-2" id="text-21">
<p>
<code>unfriendly; menacing</code>
</p>

<ul class="org-ul">
<li>When the police officer pointed the gun at me, he looked quite hostile.</li>
<li>April left her job because of the hostile work environment.</li>
<li>When I saw the hostile man approaching my car, I immediately locked my doors.</li>
<li>The hostile dog growled at me.</li>
</ul>
</div>
</div>



<div id="outline-container-org86b8147" class="outline-2">
<h2 id="org86b8147"><span class="section-number-2">22</span> <a href="https://wordsinasentence.com/huddle-in-a-sentence/">Huddle</a></h2>
<div class="outline-text-2" id="text-22">
<p>
<code>to crowd together, typically for warmth or privacy</code>
</p>

<ul class="org-ul">
<li>A football team will often huddle together so they can discuss their game plan without the other team seeing or hearing it.</li>
<li>Penguins like to huddle together so they can share their body warmth in the cold wastelands of their home.</li>
<li>My two young children decided to huddle together when the lightning and thunder from the storm above our house frightened them.</li>
<li>The soccer team decided to huddle together at the end of the game and congratulate the coach and each other on their victory.</li>
</ul>
</div>
</div>



<div id="outline-container-orgc8931e7" class="outline-2">
<h2 id="orgc8931e7"><span class="section-number-2">23</span> <a href="https://wordsinasentence.com/humdrum-in-a-sentence/">Humdrum</a></h2>
<div class="outline-text-2" id="text-23">
<p>
<code>without excitement or variety; boring</code>
</p>

<ul class="org-ul">
<li>An exciting vacation would give me time away from my humdrum job.</li>
<li>When I saw everyone sitting down at the humdrum event, I knew the evening was going to be boring.</li>
<li>With so many fights on the field, the game was far from humdrum.</li>
<li>Jack fell asleep during the professor’s humdrum speech.</li>
</ul>
</div>
</div>



<div id="outline-container-org69a46f9" class="outline-2">
<h2 id="org69a46f9"><span class="section-number-2">24</span> <a href="https://wordsinasentence.com/hurl-in-a-sentence/">Hurl</a></h2>
<div class="outline-text-2" id="text-24">
<p>
<code>to fling or toss something powerfully</code>
</p>

<ul class="org-ul">
<li>When Sarah teased her little brother, he took the book in his hand and decided to hurl it at her breaking her nose.</li>
<li>Riots broke out in the city causing rioters to hurl <b>Molotov cocktails</b> <code>燃烧瓶</code> at the approaching police.</li>
<li>When people get mad at their computers, they will often think they want to hurl it out the window causing it to smash on the ground.</li>
<li><b>Pitchers</b> will hurl the baseball at the <b>catchers</b> in a baseball game which will usually get <b>clocked</b> <code>测...的速度</code> at a 100 miles per hour.</li>
</ul>
</div>
</div>



<div id="outline-container-org7f26cbe" class="outline-2">
<h2 id="org7f26cbe"><span class="section-number-2">25</span> <a href="https://wordsinasentence.com/hyperbole-in-a-sentence/">Hyperbole</a></h2>
<div class="outline-text-2" id="text-25">
<p>
<code>an extravagant exaggeration</code>
</p>

<ul class="org-ul">
<li>The main element of the product’s commercial was a hyperbole describing rapid weight loss.</li>
<li>Although what I said may sound like a hyperbole, it really is the truth.</li>
<li>The author used one hyperbole after another to get his point across to his readers.</li>
<li>Because Janice was a drama queen, she used a hyperbole in practically every sentence.</li>
<li>During the hurricane, it seemed as though the hyperbole, “raining cats and dogs”, was almost accurate.</li>
<li>It would be great if you could simply tell me the basic facts without including a hyperbole of any sort.</li>
<li>If the politician uses one more hyperbole in his speech, I will know he is exaggerating about all his claims.</li>
</ul>
</div>
</div>
