ruby/H.org
* [[https://wordsinasentence.com/hypnotic-in-a-sentence/][Hypnotic]]

  =tending to induce sleep=

  - If I take too high a dosage of the medication, its hypnotic affect will cause me to drift into a deep sleep.
  - Melatonin is a natural hormone that is used as a sleep aid because of its hypnotic affect.
  - After taking a bite of the hypnotic apple provided by the Evil Queen, Aurora fell under a sleeping spell.
  - Falling into a hypnotic trance, the patient woke up only after the psychiatrist snapped three times.



* [[https://wordsinasentence.com/hypochondriac-in-a-sentence/][Hypochondriac]]

  =one who believes he or she is always ill=

  - Because my uncle is a hypochondriac, he is quick to diagnose himself with a life-threatening illness.
  - My college roommate was a hypochondriac who wore a facial mask to avoid inhaling germs.
  - Being a hypochondriac, Gina will go to the emergency room after sneezing only once.
  - The hypochondriac does not realize his doctor is giving him sugar pills for his imaginary *ailments*.



* [[https://wordsinasentence.com/haggard-in-a-sentence/][Haggard]]

  =appearing in poor health or spirits=

  - The woman looked haggard after sitting up for a week with her dying husband.
  - Using makeup, the artist turned the young actress into a haggard old woman.
  - The soldiers looked exhausted and haggard after walking forty miles through the desert.
  - From Jared’s haggard appearance, it is obvious he had way too much to drink last night.
  - The soldier was haggard after watching many of his friends die in battle.
  - Upon news of my mother’s death, my once vibrant father suddenly appeared haggard.
  - The haggard peasant looked as though he had not eaten in weeks.



* [[https://wordsinasentence.com/halcyon-in-a-sentence/][Halcyon]]

  =calm and undisturbed=

  - I was very content during the halcyon days of my childhood.
  - Because the waters are halcyon, today is a great day for a boat trip.
  - The isolated cabin is sure to provide me with a halcyon escape from the noise of the crowded city.
  - After three months, the celebrity couple’s halcyon marriage transformed into a path to divorce.
  - The building of the noisy multi-lane highway is sure to destroy the halcyon nature of the small town.
  - After we survived the weekend storms, we were gifted with halcyon weather.
  - With all the wars on this planet, we are definitely not living in halcyon times.



* [[https://wordsinasentence.com/hanker-in-a-sentence/][Hanker]]

  =to yearn or pine to do something=

  - After years of an unhappy marriage, the man begin to hanker to have an affair.
  - The homesick woman began to hanker for a trip to see her parents.
  - After a year away from the shore, the *beach bum* =海滩迷= began to hanker for a day he could spend surfing.
  - Should you hanker for room service in the middle of the night, be prepared to pay steep prices for the food you long for.



* [[https://wordsinasentence.com/hankering-in-a-sentence/][Hankering]]

  =to have an endless craving for or to do something=

  - I hope my husband has a hankering for fried chicken since that’s what we’re having for dinner.
  - Because I hate being hot, I never have a hankering to go to the beach.
  - Watching the woman make the vase gave me a hankering to take a pottery class.
  - If you have a hankering for the best ribs in town, then you have to go to Fat Matt’s Rib Shack.




* [[https://wordsinasentence.com/harangue-in-a-sentence/][Harangue]]

  =a loud and aggressive speech; verbal attack=

  - Even though the members of the church were falling asleep, the minister continued his harangue on the evils of society.
  - During last month’s meeting, the PTA president gave a harangue against the new superintendent.
  - While I met with Joe to have a friendly chat, he wanted to deliver another harangue about his dissatisfaction with life.
  - As usual, the priest made his usual harangue about the dangers of listening to rap music.
  - Because I spent the rent money on clothes, I will have to endure a harangue from my husband.
  - The comedian does a hilarious harangue about obnoxious celebrities.
  - Although the student council president made a passionate harangue, no one believed the students would be allowed to have a dance.



* [[https://wordsinasentence.com/harbinger-in-a-sentence/][Harbinger]]

  =one that pioneers in or initiates a major change=

  - Everyone knows the groundhog is the harbinger of a change in seasons.
  - Whenever I see clouds, I know they are a harbinger of an approaching storm.
  - The surprisingly chilly day in September is a harbinger of all that winter has to offer.
  - When the two enemies called a truce, everyone saw this action as a harbinger in their relationship.
  - Sadly I realize my persistent headache is a harbinger of the flu virus that has attacked me.
  - The birth of the young prince is a harbinger of the country’s bright future.
  - In many movies, the harbinger of death is portrayed as the grim reaper.



* [[https://wordsinasentence.com/hardihood-in-a-sentence/][Hardihood]]

  =bravery; confidence to take action=

  - The volunteer firefighter’s hardihood shined through as he burst into the burning home and saved the trapped residents.
  - Confident in his actions, the *whistleblower* =告密者= showed hardihood when he reported the illegal activities of his superiors.
  - The hardihood of the solider helped him survive while lost in the jungle while never giving up.
  - Known for his hardihood, the self-made millionaire was not afraid to take risks in business.



* [[https://wordsinasentence.com/hardy-in-a-sentence/][Hardy]]

  =tough; resilient=

  - Trees in the woodland are hardy, withstanding cold winters and severe weather in the spring.
  - Country boys are hardy and never cry when they fall or whine when they get hurt outside.
  - Although he was toughly criticized, Dr. Martin Luther King was hardy and never gave in to mounting pressure against his movement.
  - The hardy flowers bloomed year after year, even after facing icy storms that would kill most plants.



