ruby/H.html



<div id="outline-container-org714f338" class="outline-2">
<h2 id="org714f338"><span class="section-number-2">26</span> <a href="https://wordsinasentence.com/hypnotic-in-a-sentence/">Hypnotic</a></h2>
<div class="outline-text-2" id="text-26">
<p>
<code>tending to induce sleep</code>
</p>

<ul class="org-ul">
<li>If I take too high a dosage of the medication, its hypnotic affect will cause me to drift into a deep sleep.</li>
<li>Melatonin is a natural hormone that is used as a sleep aid because of its hypnotic affect.</li>
<li>After taking a bite of the hypnotic apple provided by the Evil Queen, Aurora fell under a sleeping spell.</li>
<li>Falling into a hypnotic trance, the patient woke up only after the psychiatrist snapped three times.</li>
</ul>
</div>
</div>



<div id="outline-container-org02e7a08" class="outline-2">
<h2 id="org02e7a08"><span class="section-number-2">27</span> <a href="https://wordsinasentence.com/hypochondriac-in-a-sentence/">Hypochondriac</a></h2>
<div class="outline-text-2" id="text-27">
<p>
<code>one who believes he or she is always ill</code>
</p>

<ul class="org-ul">
<li>Because my uncle is a hypochondriac, he is quick to diagnose himself with a life-threatening illness.</li>
<li>My college roommate was a hypochondriac who wore a facial mask to avoid inhaling germs.</li>
<li>Being a hypochondriac, Gina will go to the emergency room after sneezing only once.</li>
<li>The hypochondriac does not realize his doctor is giving him sugar pills for his imaginary <b>ailments</b>.</li>
</ul>
</div>
</div>



<div id="outline-container-orgc81371d" class="outline-2">
<h2 id="orgc81371d"><span class="section-number-2">28</span> <a href="https://wordsinasentence.com/haggard-in-a-sentence/">Haggard</a></h2>
<div class="outline-text-2" id="text-28">
<p>
<code>appearing in poor health or spirits</code>
</p>

<ul class="org-ul">
<li>The woman looked haggard after sitting up for a week with her dying husband.</li>
<li>Using makeup, the artist turned the young actress into a haggard old woman.</li>
<li>The soldiers looked exhausted and haggard after walking forty miles through the desert.</li>
<li>From Jared’s haggard appearance, it is obvious he had way too much to drink last night.</li>
<li>The soldier was haggard after watching many of his friends die in battle.</li>
<li>Upon news of my mother’s death, my once vibrant father suddenly appeared haggard.</li>
<li>The haggard peasant looked as though he had not eaten in weeks.</li>
</ul>
</div>
</div>



<div id="outline-container-org5ecaba8" class="outline-2">
<h2 id="org5ecaba8"><span class="section-number-2">29</span> <a href="https://wordsinasentence.com/halcyon-in-a-sentence/">Halcyon</a></h2>
<div class="outline-text-2" id="text-29">
<p>
<code>calm and undisturbed</code>
</p>

<ul class="org-ul">
<li>I was very content during the halcyon days of my childhood.</li>
<li>Because the waters are halcyon, today is a great day for a boat trip.</li>
<li>The isolated cabin is sure to provide me with a halcyon escape from the noise of the crowded city.</li>
<li>After three months, the celebrity couple’s halcyon marriage transformed into a path to divorce.</li>
<li>The building of the noisy multi-lane highway is sure to destroy the halcyon nature of the small town.</li>
<li>After we survived the weekend storms, we were gifted with halcyon weather.</li>
<li>With all the wars on this planet, we are definitely not living in halcyon times.</li>
</ul>
</div>
</div>



<div id="outline-container-orgd066f1d" class="outline-2">
<h2 id="orgd066f1d"><span class="section-number-2">30</span> <a href="https://wordsinasentence.com/hanker-in-a-sentence/">Hanker</a></h2>
<div class="outline-text-2" id="text-30">
<p>
<code>to yearn or pine to do something</code>
</p>

<ul class="org-ul">
<li>After years of an unhappy marriage, the man begin to hanker to have an affair.</li>
<li>The homesick woman began to hanker for a trip to see her parents.</li>
<li>After a year away from the shore, the <b>beach bum</b> <code>海滩迷</code> began to hanker for a day he could spend surfing.</li>
<li>Should you hanker for room service in the middle of the night, be prepared to pay steep prices for the food you long for.</li>
</ul>
</div>
</div>



<div id="outline-container-org9dc4567" class="outline-2">
<h2 id="org9dc4567"><span class="section-number-2">31</span> <a href="https://wordsinasentence.com/hankering-in-a-sentence/">Hankering</a></h2>
<div class="outline-text-2" id="text-31">
<p>
<code>to have an endless craving for or to do something</code>
</p>

<ul class="org-ul">
<li>I hope my husband has a hankering for fried chicken since that’s what we’re having for dinner.</li>
<li>Because I hate being hot, I never have a hankering to go to the beach.</li>
<li>Watching the woman make the vase gave me a hankering to take a pottery class.</li>
<li>If you have a hankering for the best ribs in town, then you have to go to Fat Matt’s Rib Shack.</li>
</ul>
</div>
</div>




<div id="outline-container-org40aa434" class="outline-2">
<h2 id="org40aa434"><span class="section-number-2">32</span> <a href="https://wordsinasentence.com/harangue-in-a-sentence/">Harangue</a></h2>
<div class="outline-text-2" id="text-32">
<p>
<code>a loud and aggressive speech; verbal attack</code>
</p>

<ul class="org-ul">
<li>Even though the members of the church were falling asleep, the minister continued his harangue on the evils of society.</li>
<li>During last month’s meeting, the PTA president gave a harangue against the new superintendent.</li>
<li>While I met with Joe to have a friendly chat, he wanted to deliver another harangue about his dissatisfaction with life.</li>
<li>As usual, the priest made his usual harangue about the dangers of listening to rap music.</li>
<li>Because I spent the rent money on clothes, I will have to endure a harangue from my husband.</li>
<li>The comedian does a hilarious harangue about obnoxious celebrities.</li>
<li>Although the student council president made a passionate harangue, no one believed the students would be allowed to have a dance.</li>
</ul>
</div>
</div>



<div id="outline-container-orga90314a" class="outline-2">
<h2 id="orga90314a"><span class="section-number-2">33</span> <a href="https://wordsinasentence.com/harbinger-in-a-sentence/">Harbinger</a></h2>
<div class="outline-text-2" id="text-33">
<p>
<code>one that pioneers in or initiates a major change</code>
</p>

<ul class="org-ul">
<li>Everyone knows the groundhog is the harbinger of a change in seasons.</li>
<li>Whenever I see clouds, I know they are a harbinger of an approaching storm.</li>
<li>The surprisingly chilly day in September is a harbinger of all that winter has to offer.</li>
<li>When the two enemies called a truce, everyone saw this action as a harbinger in their relationship.</li>
<li>Sadly I realize my persistent headache is a harbinger of the flu virus that has attacked me.</li>
<li>The birth of the young prince is a harbinger of the country’s bright future.</li>
<li>In many movies, the harbinger of death is portrayed as the grim reaper.</li>
</ul>
</div>
</div>



<div id="outline-container-orge803b35" class="outline-2">
<h2 id="orge803b35"><span class="section-number-2">34</span> <a href="https://wordsinasentence.com/hardihood-in-a-sentence/">Hardihood</a></h2>
<div class="outline-text-2" id="text-34">
<p>
<code>bravery; confidence to take action</code>
</p>

<ul class="org-ul">
<li>The volunteer firefighter’s hardihood shined through as he burst into the burning home and saved the trapped residents.</li>
<li>Confident in his actions, the <b>whistleblower</b> <code>告密者</code> showed hardihood when he reported the illegal activities of his superiors.</li>
<li>The hardihood of the solider helped him survive while lost in the jungle while never giving up.</li>
<li>Known for his hardihood, the self-made millionaire was not afraid to take risks in business.</li>
</ul>
</div>
</div>



<div id="outline-container-org8377412" class="outline-2">
<h2 id="org8377412"><span class="section-number-2">35</span> <a href="https://wordsinasentence.com/hardy-in-a-sentence/">Hardy</a></h2>
<div class="outline-text-2" id="text-35">
<p>
<code>tough; resilient</code>
</p>

<ul class="org-ul">
<li>Trees in the woodland are hardy, withstanding cold winters and severe weather in the spring.</li>
<li>Country boys are hardy and never cry when they fall or whine when they get hurt outside.</li>
<li>Although he was toughly criticized, Dr. Martin Luther King was hardy and never gave in to mounting pressure against his movement.</li>
<li>The hardy flowers bloomed year after year, even after facing icy storms that would kill most plants.</li>
</ul>
</div>
</div>
