ruby/H.org
* [[https://wordsinasentence.com/harness-in-a-sentence/][Harness]]

  =straps or fittings used to hold something in place=

  - The tightrope walker was fitted with a harness to stop him from plummeting to his death if he slipped.
  - A harness was needed to insure that the rollercoaster riders did not slip out the seatbelt while upside down.
  - Each horse was fitted with a harness before being led through the children’s parade.
  - The caving adventurer was lowered into the abyss while wearing a harness to protect him from a steep fall.



* [[https://wordsinasentence.com/harrow-in-a-sentence/][Harrow]]

  =a farming device with sharp metal blades that is dragged across land to smooth or break up the soil=

  - Once the harrow broke up the *clods* of dirt on the farm, the farmer was able to plant the seeds.
  - Purchasing a harrow will allow any farmer to prepare their soil more quickly for production.
  - At the farm equipment auction, a harrow was bought by someone who realized the value in this equipment on his hard clay dirt.
  - Without having access to a harrow, the pioneer could only harvest his soil by hand.



* [[https://wordsinasentence.com/hasten-in-a-sentence/][Hasten]]

  =to move in a quick fashion=

  - Marilyn made an attempt to hasten the death of her elderly husband by putting *arsenic* in his food.
  - Sadly, the new tax law will hasten the closure of many small businesses.
  - Failing to wash your hands properly will hasten the spread of the flu virus.
  - When I was a kid, I would often try to hasten the arrival of Christmas by going to bed early on Christmas Eve.
  - Chewing the medication will not hasten the drug’s *onset* =发作= and cause it to act faster.
  - When the store manager saw the long lines at the registers, he called for more cashiers to hasten customer checkouts.
  - The evil *slumlord* =平民窟房东= was convicted of taking illegal actions to hasten his tenants’ evictions.



* [[https://wordsinasentence.com/hasty-in-a-sentence/][Hasty]]

  =speedy; hurried=

  - The professor’s hasty speech confused the students as they had no clue what he had said.
  - After making several hasty purchases in one day, the shopper felt guilty.
  - The thief made a hasty exit out the door after stealing several diamond rings.
  - Though they had only dated for a month, the couple *made a hasty rush to the altar*.



* [[https://wordsinasentence.com/hazy-in-a-sentence/][Hazy]]

  =cloudy; foggy=

  - Because the windshield was so fogged up, everything along the highway looked hazy.
  - The hazy trees blocked the western view of the river.
  - After his accident, the man’s memory of the events was blurred and hazy.
  - Clouds of smoke that filled the bar made for a hazy atmosphere.



* [[https://wordsinasentence.com/headlong-in-a-sentence/][Headlong]]

  =done rashly and without thinking=

  - The teenagers jumped headlong into a committed relationship.
  - She signed the document headlong without considering the *implications*.
  - The adventurous man had a habit of diving headlong into new risky business ventures.
  - Without thinking, the good samaritan had rushed headlong into the fire.



* [[https://wordsinasentence.com/headway-in-a-sentence/][Headway]]

  =progress or forward movement=

  - Just when then counselor thought they were making headway, the couple decided to end their therapy sessions.
  - The student’s grades were improving, but he did not make as much headway as his teacher had.
  - Little headway was made by the troop against enemy forces.
  - The prosecutor made no headway in trying to convince the judge to postpone bail.



* [[https://wordsinasentence.com/heady-in-a-sentence/][Heady]]

  =a strong, intense, or exhilarating effect=

  - Many pilots find supersonic flight to be a heady experience, providing them with exhilaration that can’t be matched by anything else.
  - The reason people find it so easy to become addicted to alcohol is because the heady experience it provides makes them come back for more, especially when they are stressed.
  - A heady experience can best be described as one that is so exciting or exhilarating that you want even more of it.
  - I do not see why people get so attached to drugs, but apparently the high is heady enough to make them do anything for more.



* [[https://wordsinasentence.com/hearken-in-a-sentence/][Hearken]]

  =to listen=

  - Confident and proud, the young man refused to hearken his parents’ advice.
  - The boy was confused about the directions because he did not hearken his teacher’s lecture.
  - An inability to hearken simple instructions caused the distracted passenger to miss his stop.
  - If my brother would hearken my advice, he would make much better grades in school.



* [[https://wordsinasentence.com/hearsay-in-a-sentence/][Hearsay]]

  =information gained from a source that was not directly involved and cannot be proved accurate=

  - Without a witness, the police could not prove that the hearsay was anything more than fiction.
  - Don't believe the teacher's hearsay about school being closed tomorrow due to the snowstorm unless you hear it directly from the news.
  - I would regard the layoff rumors as hearsay, because they've been swirling around for months and our company has been growing.
  - Court officials dismissed the witness’s testimony as hearsay.



* [[https://wordsinasentence.com/heave-in-a-sentence/][Heave]]

  =to use a lot of effort while moving something=

  - A half-court heave of the ball ended in a surprising *buzzer beater* =绝杀= win for the underdogs.
  - With each heave of the *spade*, the man shoveled more and more snow out of the driveway.
  - After he tried to heave the heavy weight above his head for a third time, the weak lifter decided to give up.
- Because we were in a rush to get on the road, my brother and I quickly began to heave our clothes into a suitcase.



