ruby/H.html



<div id="outline-container-orgfc5effa" class="outline-2">
<h2 id="orgfc5effa"><span class="section-number-2">36</span> <a href="https://wordsinasentence.com/harness-in-a-sentence/">Harness</a></h2>
<div class="outline-text-2" id="text-36">
<p>
<code>straps or fittings used to hold something in place</code>
</p>

<ul class="org-ul">
<li>The tightrope walker was fitted with a harness to stop him from plummeting to his death if he slipped.</li>
<li>A harness was needed to insure that the rollercoaster riders did not slip out the seatbelt while upside down.</li>
<li>Each horse was fitted with a harness before being led through the children’s parade.</li>
<li>The caving adventurer was lowered into the abyss while wearing a harness to protect him from a steep fall.</li>
</ul>
</div>
</div>



<div id="outline-container-org549c360" class="outline-2">
<h2 id="org549c360"><span class="section-number-2">37</span> <a href="https://wordsinasentence.com/harrow-in-a-sentence/">Harrow</a></h2>
<div class="outline-text-2" id="text-37">
<p>
<code>a farming device with sharp metal blades that is dragged across land to smooth or break up the soil</code>
</p>

<ul class="org-ul">
<li>Once the harrow broke up the <b>clods</b> of dirt on the farm, the farmer was able to plant the seeds.</li>
<li>Purchasing a harrow will allow any farmer to prepare their soil more quickly for production.</li>
<li>At the farm equipment auction, a harrow was bought by someone who realized the value in this equipment on his hard clay dirt.</li>
<li>Without having access to a harrow, the pioneer could only harvest his soil by hand.</li>
</ul>
</div>
</div>



<div id="outline-container-orgf126433" class="outline-2">
<h2 id="orgf126433"><span class="section-number-2">38</span> <a href="https://wordsinasentence.com/hasten-in-a-sentence/">Hasten</a></h2>
<div class="outline-text-2" id="text-38">
<p>
<code>to move in a quick fashion</code>
</p>

<ul class="org-ul">
<li>Marilyn made an attempt to hasten the death of her elderly husband by putting <b>arsenic</b> in his food.</li>
<li>Sadly, the new tax law will hasten the closure of many small businesses.</li>
<li>Failing to wash your hands properly will hasten the spread of the flu virus.</li>
<li>When I was a kid, I would often try to hasten the arrival of Christmas by going to bed early on Christmas Eve.</li>
<li>Chewing the medication will not hasten the drug’s <b>onset</b> <code>发作</code> and cause it to act faster.</li>
<li>When the store manager saw the long lines at the registers, he called for more cashiers to hasten customer checkouts.</li>
<li>The evil <b>slumlord</b> <code>平民窟房东</code> was convicted of taking illegal actions to hasten his tenants’ evictions.</li>
</ul>
</div>
</div>



<div id="outline-container-org79cfc59" class="outline-2">
<h2 id="org79cfc59"><span class="section-number-2">39</span> <a href="https://wordsinasentence.com/hasty-in-a-sentence/">Hasty</a></h2>
<div class="outline-text-2" id="text-39">
<p>
<code>speedy; hurried</code>
</p>

<ul class="org-ul">
<li>The professor’s hasty speech confused the students as they had no clue what he had said.</li>
<li>After making several hasty purchases in one day, the shopper felt guilty.</li>
<li>The thief made a hasty exit out the door after stealing several diamond rings.</li>
<li>Though they had only dated for a month, the couple <b>made a hasty rush to the altar</b>.</li>
</ul>
</div>
</div>



<div id="outline-container-orgd454445" class="outline-2">
<h2 id="orgd454445"><span class="section-number-2">40</span> <a href="https://wordsinasentence.com/hazy-in-a-sentence/">Hazy</a></h2>
<div class="outline-text-2" id="text-40">
<p>
<code>cloudy; foggy</code>
</p>

<ul class="org-ul">
<li>Because the windshield was so fogged up, everything along the highway looked hazy.</li>
<li>The hazy trees blocked the western view of the river.</li>
<li>After his accident, the man’s memory of the events was blurred and hazy.</li>
<li>Clouds of smoke that filled the bar made for a hazy atmosphere.</li>
</ul>
</div>
</div>



<div id="outline-container-orgfffd03e" class="outline-2">
<h2 id="orgfffd03e"><span class="section-number-2">41</span> <a href="https://wordsinasentence.com/headlong-in-a-sentence/">Headlong</a></h2>
<div class="outline-text-2" id="text-41">
<p>
<code>done rashly and without thinking</code>
</p>

<ul class="org-ul">
<li>The teenagers jumped headlong into a committed relationship.</li>
<li>She signed the document headlong without considering the <b>implications</b>.</li>
<li>The adventurous man had a habit of diving headlong into new risky business ventures.</li>
<li>Without thinking, the good samaritan had rushed headlong into the fire.</li>
</ul>
</div>
</div>



<div id="outline-container-org08fa41c" class="outline-2">
<h2 id="org08fa41c"><span class="section-number-2">42</span> <a href="https://wordsinasentence.com/headway-in-a-sentence/">Headway</a></h2>
<div class="outline-text-2" id="text-42">
<p>
<code>progress or forward movement</code>
</p>

<ul class="org-ul">
<li>Just when then counselor thought they were making headway, the couple decided to end their therapy sessions.</li>
<li>The student’s grades were improving, but he did not make as much headway as his teacher had.</li>
<li>Little headway was made by the troop against enemy forces.</li>
<li>The prosecutor made no headway in trying to convince the judge to postpone bail.</li>
</ul>
</div>
</div>



<div id="outline-container-orga9f3dd1" class="outline-2">
<h2 id="orga9f3dd1"><span class="section-number-2">43</span> <a href="https://wordsinasentence.com/heady-in-a-sentence/">Heady</a></h2>
<div class="outline-text-2" id="text-43">
<p>
<code>a strong, intense, or exhilarating effect</code>
</p>

<ul class="org-ul">
<li>Many pilots find supersonic flight to be a heady experience, providing them with exhilaration that can’t be matched by anything else.</li>
<li>The reason people find it so easy to become addicted to alcohol is because the heady experience it provides makes them come back for more, especially when they are stressed.</li>
<li>A heady experience can best be described as one that is so exciting or exhilarating that you want even more of it.</li>
<li>I do not see why people get so attached to drugs, but apparently the high is heady enough to make them do anything for more.</li>
</ul>
</div>
</div>



<div id="outline-container-org8cec33b" class="outline-2">
<h2 id="org8cec33b"><span class="section-number-2">44</span> <a href="https://wordsinasentence.com/hearken-in-a-sentence/">Hearken</a></h2>
<div class="outline-text-2" id="text-44">
<p>
<code>to listen</code>
</p>

<ul class="org-ul">
<li>Confident and proud, the young man refused to hearken his parents’ advice.</li>
<li>The boy was confused about the directions because he did not hearken his teacher’s lecture.</li>
<li>An inability to hearken simple instructions caused the distracted passenger to miss his stop.</li>
<li>If my brother would hearken my advice, he would make much better grades in school.</li>
</ul>
</div>
</div>



<div id="outline-container-org7c974f3" class="outline-2">
<h2 id="org7c974f3"><span class="section-number-2">45</span> <a href="https://wordsinasentence.com/hearsay-in-a-sentence/">Hearsay</a></h2>
<div class="outline-text-2" id="text-45">
<p>
<code>information gained from a source that was not directly involved and cannot be proved accurate</code>
</p>

<ul class="org-ul">
<li>Without a witness, the police could not prove that the hearsay was anything more than fiction.</li>
<li>Don't believe the teacher's hearsay about school being closed tomorrow due to the snowstorm unless you hear it directly from the news.</li>
<li>I would regard the layoff rumors as hearsay, because they've been swirling around for months and our company has been growing.</li>
<li>Court officials dismissed the witness’s testimony as hearsay.</li>
</ul>
</div>
</div>



<div id="outline-container-org410f0bb" class="outline-2">
<h2 id="org410f0bb"><span class="section-number-2">46</span> <a href="https://wordsinasentence.com/heave-in-a-sentence/">Heave</a></h2>
<div class="outline-text-2" id="text-46">
<p>
<code>to use a lot of effort while moving something</code>
</p>

<ul class="org-ul">
<li>A half-court heave of the ball ended in a surprising <b>buzzer beater</b> <code>绝杀</code> win for the underdogs.</li>
<li>With each heave of the <b>spade</b>, the man shoveled more and more snow out of the driveway.</li>
<li>After he tried to heave the heavy weight above his head for a third time, the weak lifter decided to give up.</li>
</ul>
<ul class="org-ul">
<li>Because we were in a rush to get on the road, my brother and I quickly began to heave our clothes into a suitcase.</li>
</ul>
</div>
</div>
