ruby/H.org
* [[https://wordsinasentence.com/heckle-in-a-sentence/][Heckle]]

  =to interrupt a speaker with insulting or rude comments=

  - As they began to heckle the speaker with insulting gestures, the two protesters were escorted from the building.
  - The crowd began to boo and heckle the comedian as he bombed his comedy set.
  - A group of pranksters stood outside of the school so that they could heckle the principal.
  - Hurling insults from the *bleachers* =体育场馆的廉价露天座位= , a few parents from the opposing team began to heckle the batter stepping up to the plate.



* [[https://wordsinasentence.com/hectic-in-a-sentence/][Hectic]]

  =quite busy with goings-on and uncertainty=

  - Since I have a lot to do this week, my schedule is going to be very hectic.
  - Candace’s life became hectic after she learned she had to plan a wedding in two days.
  - Despite my father’s hectic travel schedule, he still manages to get home every weekend.
  - The processing pace is hectic, but once you find the right rhythm, you should be able to keep up on the assembly line.



* [[https://wordsinasentence.com/hedge-in-a-sentence/][Hedge]]

  =bushes or shrubs that form a boundary as they grow closely together in a row=

  - An ever-growing hedge stops nosy neighbors from being able to see into the back yard.
  - Trimming the tall hedge, the lawn maintenance worker made sure to keep the bush looking neat.
  - Forming a hedge around the moat, the *prickly* *shrubs* provided even more protection for the king’s castle.
  - My mother insisted my father remove the hedge that circled around our house since she preferred trees over bushes.



* [[https://wordsinasentence.com/hermetic-in-a-sentence/][Hermetic]]

  =associated with a lifestyle in which a person or group is isolated from others=

  - As a freelance writer who rarely leaves her house, Kate lives a hermetic lifestyle.
  - The billionaire bought a private island so he could raise his kids in a hermetic environment.
  - Because the monk maintained a hermetic lifestyle for twenty years, he was overwhelmed when he moved to a crowded city.
  - The hermetic tribe lives in an isolated part of the continent and has little contact with people outside of its group.



* [[https://wordsinasentence.com/hew-in-a-sentence/][Hew]]

  =using heavy blows to hack with a tool or instrument=

  - When my father got angry with my mother, he would go in the backyard and hew wood with his axe.
  - The man used a *scythe* to hew his way through the field of grass.
  - While the little boy wanted to hew trees with his big brother, he was too small to wield an axe.
  - The jeweler has tools that allow him to hew precious stones so they will fit in specific ring bases.



* [[https://wordsinasentence.com/hidebound-in-a-sentence/][Hidebound]]

  =rigidly opposed to change=

  - The hidebound politician refused to change his position on the abortion bill.
  - Because my grandmother is hidebound, she does not believe in interracial marriage.
  - The older members of the club are hidebound and will not consider changing the group’s membership requirements.
  - In some cultures, men remain hidebound to the belief women should not show their faces in public.



* [[https://wordsinasentence.com/hinder-in-a-sentence/][Hinder]]

  =to hold back or to make difficult to accomplish=

  - Tight, restrictive clothing will work to hinder your athletic performance.
  - Having misaligned tires is a sure way to hinder your driving.
  - If you do not rest enough, you will actually hinder your workout progress.
  - Drinking alcohol after you exercise is sure to hinder your progress.
  - The power outage hindered his ability to get his research done.
  - If you fail to tie your shoes, you will hinder your ability to run.
  - An ankle injury will greatly hinder your ability to exercise.



* [[https://wordsinasentence.com/hoarse-in-a-sentence/][Hoarse]]

  =afflicted by a dry, quite harsh voice=

  - Jessica was unable to sing with the choir because her voice sounded hoarse.
  - When I had my tonsils taken out, I was so hoarse I could only whisper for days.
  - Kason yelled so much at the basketball game that he woke up hoarse the next morning.
  - Drinking hot tea with honey and lemon is supposed to help a person who is feeling hoarse.



* [[https://wordsinasentence.com/hoary-in-a-sentence/][Hoary]]

  =incredibly old=

  - The hoary house was built in the eighteenth century and is now part of a museum.
  - When someone told me Jeff’s girlfriend was hoary, I could not believe my pal would date a woman three times his age.
  - The hoary tree has been living in the field for over two centuries.
  - Because the computer is hoary, it is doubtful it will function after being in a closet for nearly twenty years.



* [[https://wordsinasentence.com/hoax-in-a-sentence/][Hoax]]

  =a ploy or story used to trick a person or group=

  - The woman used a pregnancy hoax to trick her boyfriend into marrying her.
  - If the magazine editor believes the picture is a hoax, he will not publish it.
  - The hoax about the bomb was enough to get the prankster arrested.
  - Before the insurance company pays the claim, they will send an investigator to ensure the man’s injury is not a hoax.



* [[https://wordsinasentence.com/hoist-in-a-sentence/][Hoist]]

  =to lift up or elevate=

  - We grabbed the flag and began to hoist it up the flagpole.
  - A crane was needed to hoist Jessica’s car out of the river.
  - We helped Mike hoist the groom onto his shoulders.
  - John will hoist up his banner and wave it to get attention.



* [[https://wordsinasentence.com/homage-in-a-sentence/][Homage]]

  =an act performed to show respect=

  - As a sign of homage for the *late president*, government flags will be flown half-mast today.
  - To show homage, the poor people brought gifts to the god's temple.
  - The soldiers displayed homage to their fallen comrade by saluting his coffin.
  - When the singer accepted his award, he paid homage to all of his musical inspirations by thanking them in his speech.



