ruby/H.html



<div id="outline-container-org288eb88" class="outline-2">
<h2 id="org288eb88"><span class="section-number-2">47</span> <a href="https://wordsinasentence.com/heckle-in-a-sentence/">Heckle</a></h2>
<div class="outline-text-2" id="text-47">
<p>
<code>to interrupt a speaker with insulting or rude comments</code>
</p>

<ul class="org-ul">
<li>As they began to heckle the speaker with insulting gestures, the two protesters were escorted from the building.</li>
<li>The crowd began to boo and heckle the comedian as he bombed his comedy set.</li>
<li>A group of pranksters stood outside of the school so that they could heckle the principal.</li>
<li>Hurling insults from the <b>bleachers</b> <code>体育场馆的廉价露天座位</code> , a few parents from the opposing team began to heckle the batter stepping up to the plate.</li>
</ul>
</div>
</div>



<div id="outline-container-org9f707da" class="outline-2">
<h2 id="org9f707da"><span class="section-number-2">48</span> <a href="https://wordsinasentence.com/hectic-in-a-sentence/">Hectic</a></h2>
<div class="outline-text-2" id="text-48">
<p>
<code>quite busy with goings-on and uncertainty</code>
</p>

<ul class="org-ul">
<li>Since I have a lot to do this week, my schedule is going to be very hectic.</li>
<li>Candace’s life became hectic after she learned she had to plan a wedding in two days.</li>
<li>Despite my father’s hectic travel schedule, he still manages to get home every weekend.</li>
<li>The processing pace is hectic, but once you find the right rhythm, you should be able to keep up on the assembly line.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb173700" class="outline-2">
<h2 id="orgb173700"><span class="section-number-2">49</span> <a href="https://wordsinasentence.com/hedge-in-a-sentence/">Hedge</a></h2>
<div class="outline-text-2" id="text-49">
<p>
<code>bushes or shrubs that form a boundary as they grow closely together in a row</code>
</p>

<ul class="org-ul">
<li>An ever-growing hedge stops nosy neighbors from being able to see into the back yard.</li>
<li>Trimming the tall hedge, the lawn maintenance worker made sure to keep the bush looking neat.</li>
<li>Forming a hedge around the moat, the <b>prickly</b> <b>shrubs</b> provided even more protection for the king’s castle.</li>
<li>My mother insisted my father remove the hedge that circled around our house since she preferred trees over bushes.</li>
</ul>
</div>
</div>



<div id="outline-container-org400a284" class="outline-2">
<h2 id="org400a284"><span class="section-number-2">50</span> <a href="https://wordsinasentence.com/hermetic-in-a-sentence/">Hermetic</a></h2>
<div class="outline-text-2" id="text-50">
<p>
<code>associated with a lifestyle in which a person or group is isolated from others</code>
</p>

<ul class="org-ul">
<li>As a freelance writer who rarely leaves her house, Kate lives a hermetic lifestyle.</li>
<li>The billionaire bought a private island so he could raise his kids in a hermetic environment.</li>
<li>Because the monk maintained a hermetic lifestyle for twenty years, he was overwhelmed when he moved to a crowded city.</li>
<li>The hermetic tribe lives in an isolated part of the continent and has little contact with people outside of its group.</li>
</ul>
</div>
</div>



<div id="outline-container-orgbee8969" class="outline-2">
<h2 id="orgbee8969"><span class="section-number-2">51</span> <a href="https://wordsinasentence.com/hew-in-a-sentence/">Hew</a></h2>
<div class="outline-text-2" id="text-51">
<p>
<code>using heavy blows to hack with a tool or instrument</code>
</p>

<ul class="org-ul">
<li>When my father got angry with my mother, he would go in the backyard and hew wood with his axe.</li>
<li>The man used a <b>scythe</b> to hew his way through the field of grass.</li>
<li>While the little boy wanted to hew trees with his big brother, he was too small to wield an axe.</li>
<li>The jeweler has tools that allow him to hew precious stones so they will fit in specific ring bases.</li>
</ul>
</div>
</div>



<div id="outline-container-org0612ccf" class="outline-2">
<h2 id="org0612ccf"><span class="section-number-2">52</span> <a href="https://wordsinasentence.com/hidebound-in-a-sentence/">Hidebound</a></h2>
<div class="outline-text-2" id="text-52">
<p>
<code>rigidly opposed to change</code>
</p>

<ul class="org-ul">
<li>The hidebound politician refused to change his position on the abortion bill.</li>
<li>Because my grandmother is hidebound, she does not believe in interracial marriage.</li>
<li>The older members of the club are hidebound and will not consider changing the group’s membership requirements.</li>
<li>In some cultures, men remain hidebound to the belief women should not show their faces in public.</li>
</ul>
</div>
</div>



<div id="outline-container-org3203bd7" class="outline-2">
<h2 id="org3203bd7"><span class="section-number-2">53</span> <a href="https://wordsinasentence.com/hinder-in-a-sentence/">Hinder</a></h2>
<div class="outline-text-2" id="text-53">
<p>
<code>to hold back or to make difficult to accomplish</code>
</p>

<ul class="org-ul">
<li>Tight, restrictive clothing will work to hinder your athletic performance.</li>
<li>Having misaligned tires is a sure way to hinder your driving.</li>
<li>If you do not rest enough, you will actually hinder your workout progress.</li>
<li>Drinking alcohol after you exercise is sure to hinder your progress.</li>
<li>The power outage hindered his ability to get his research done.</li>
<li>If you fail to tie your shoes, you will hinder your ability to run.</li>
<li>An ankle injury will greatly hinder your ability to exercise.</li>
</ul>
</div>
</div>



<div id="outline-container-org743fb4c" class="outline-2">
<h2 id="org743fb4c"><span class="section-number-2">54</span> <a href="https://wordsinasentence.com/hoarse-in-a-sentence/">Hoarse</a></h2>
<div class="outline-text-2" id="text-54">
<p>
<code>afflicted by a dry, quite harsh voice</code>
</p>

<ul class="org-ul">
<li>Jessica was unable to sing with the choir because her voice sounded hoarse.</li>
<li>When I had my tonsils taken out, I was so hoarse I could only whisper for days.</li>
<li>Kason yelled so much at the basketball game that he woke up hoarse the next morning.</li>
<li>Drinking hot tea with honey and lemon is supposed to help a person who is feeling hoarse.</li>
</ul>
</div>
</div>



<div id="outline-container-org472233c" class="outline-2">
<h2 id="org472233c"><span class="section-number-2">55</span> <a href="https://wordsinasentence.com/hoary-in-a-sentence/">Hoary</a></h2>
<div class="outline-text-2" id="text-55">
<p>
<code>incredibly old</code>
</p>

<ul class="org-ul">
<li>The hoary house was built in the eighteenth century and is now part of a museum.</li>
<li>When someone told me Jeff’s girlfriend was hoary, I could not believe my pal would date a woman three times his age.</li>
<li>The hoary tree has been living in the field for over two centuries.</li>
<li>Because the computer is hoary, it is doubtful it will function after being in a closet for nearly twenty years.</li>
</ul>
</div>
</div>



<div id="outline-container-orgbd8d7da" class="outline-2">
<h2 id="orgbd8d7da"><span class="section-number-2">56</span> <a href="https://wordsinasentence.com/hoax-in-a-sentence/">Hoax</a></h2>
<div class="outline-text-2" id="text-56">
<p>
<code>a ploy or story used to trick a person or group</code>
</p>

<ul class="org-ul">
<li>The woman used a pregnancy hoax to trick her boyfriend into marrying her.</li>
<li>If the magazine editor believes the picture is a hoax, he will not publish it.</li>
<li>The hoax about the bomb was enough to get the prankster arrested.</li>
<li>Before the insurance company pays the claim, they will send an investigator to ensure the man’s injury is not a hoax.</li>
</ul>
</div>
</div>



<div id="outline-container-org94b7d2a" class="outline-2">
<h2 id="org94b7d2a"><span class="section-number-2">57</span> <a href="https://wordsinasentence.com/hoist-in-a-sentence/">Hoist</a></h2>
<div class="outline-text-2" id="text-57">
<p>
<code>to lift up or elevate</code>
</p>

<ul class="org-ul">
<li>We grabbed the flag and began to hoist it up the flagpole.</li>
<li>A crane was needed to hoist Jessica’s car out of the river.</li>
<li>We helped Mike hoist the groom onto his shoulders.</li>
<li>John will hoist up his banner and wave it to get attention.</li>
</ul>
</div>
</div>



<div id="outline-container-orgf4ded4f" class="outline-2">
<h2 id="orgf4ded4f"><span class="section-number-2">58</span> <a href="https://wordsinasentence.com/homage-in-a-sentence/">Homage</a></h2>
<div class="outline-text-2" id="text-58">
<p>
<code>an act performed to show respect</code>
</p>

<ul class="org-ul">
<li>As a sign of homage for the <b>late president</b>, government flags will be flown half-mast today.</li>
<li>To show homage, the poor people brought gifts to the god's temple.</li>
<li>The soldiers displayed homage to their fallen comrade by saluting his coffin.</li>
<li>When the singer accepted his award, he paid homage to all of his musical inspirations by thanking them in his speech.</li>
</ul>
</div>
</div>
