ruby/H.org
* [[https://wordsinasentence.com/homely-in-a-sentence/][Homely]]

  =unattractive and plain in appearance=

  - The homely girl’s classmates thought she needed a makeover to make her more attractive.
  - Homely and plain, the woman was known for her delicious cooking but not her looks.
  - If modest Martha would put on makeup and a party dress, he might appear less homely.
  - Embarrassed by her homely appearance, Lily tried to make herself appear less attractive.



* [[https://wordsinasentence.com/hone-in-a-sentence/][Hone]]

  =to perfect a talent or skill=

  - The tennis player practices several hours a day to hone her skills.
  - Because Jessica wants to hone her cake baking ability, she can usually be found in the kitchen.
  - The apprentice will hone his mechanical expertise under a mentor and then open his own garage.
  - To stand a chance at winning the ice sculpting contest, Mark will need to hone his carving skills.



* [[https://wordsinasentence.com/hoodwink-in-a-sentence/][Hoodwink]]

  =to trick or deceive someone=

  - In an attempt to hoodwink the woman into opening the front door, the rapist pretended to be a police officer.
  - Car dealerships often hoodwink customers into coming to their lots by making promises of incredibly low payments.
  - In the shady bar, the bartender is known for trying to hoodwink customers by passing off cheap whiskey as a premium brand.
  - The con artist was arrested when he tried to hoodwink the undercover police officer.
  - Since Jed does not want a bachelor party, it is my job to hoodwink him into attending the celebration I have secretly planned.
  - Stores hoodwink customers by increasing prices on items and then offering special discounts on the same products.
  - As Patrick read the suspicious email, he realized someone was trying to hoodwink him into sharing his financial information.



* [[https://wordsinasentence.com/horrendous-in-a-sentence/][Horrendous]]

  =horrific; terrible=

  - The villagers were shocked that a boy so young could commit such a horrendous crime with no regard for human life.
  - At the site of the horrendous traffic accident, people rushed to help free the children from the burning bus.
  - The state of the rental house was horrendous, with the previous renters having completely destroyed the property.
  - Life in the poverty-stricken city is horrendous since most people there are living in terrible conditions without food or water.



* [[https://wordsinasentence.com/horticulture-in-a-sentence/][Horticulture]]

  =the science of caring for gardens; gardening=

  - Bob enrolled in a class that teaches horticulture so that he can cultivate his garden.
  - Horticulture is an art that requires getting your hands dirty, although being able to create a great garden is very rewarding.
  - We are experiencing a drought which will have a lasting effect on the horticulture industry.
  - The government is offering incentives for people to take up horticulture in the hope that it will make our city more pretty than it already is.


* [[https://wordsinasentence.com/hubris-in-a-sentence/][Hubris]]

  =an excess of confidence; having too much pride and personal worth=

  - The leader of the cult had so much hubris he believed the government would never be able to capture him.
  - Although the priest had taken a vow to help others, his own personal judgment was blinded by hubris.
  - Since Cynthia won the beauty pageant, she has allowed her hubris to turn into arrogance.
  - Most politicians are so inflated by their own hubris they cannot understand the needs of their communities.
  - Feeling unbeatable because of her hubris, Carolyn did not prepare well for the contest and lost.
  - Don’t let your hubris cost you friends!
  - Although Michael won over twenty Olympic medals, his hubris did not isolate him from the other athletes.



* [[https://wordsinasentence.com/hue-in-a-sentence/][Hue]]

  =a shade of color=

  - Placing the cloth over the lamp produced a blue hue in our bedroom.
  - Can anyone tell me why there is a strange purple hue in the background of my pictures?
  - The pale hue of the patient’s skin was a sign of anemia.
  - As I stood on the balcony, I tried to take a photo of the hue of the setting sun.



* [[https://wordsinasentence.com/hurtle-in-a-sentence/][Hurtle]]

  =move at a rapid pace in a wild manner=

  - The force of the truck caused the car to hurtle over the bridge.
  - If you live in a trailer, you should evacuate at once because the hurricane could cause your home  to hurtle through the air.
  - Throwing the glass vase against the wall will cause pieces of it to hurtle in random directions.
  - Even under the pilot’s control, the damaged plane seemed to hurtle towards the runway.



* [[https://wordsinasentence.com/husbandry-in-a-sentence/][Husbandry]]

  =the breeding and/or cultivation of animals and/or crops=

  - Because we engage in husbandry and produce our own food, we do not have huge grocery store bills.
  - Elena studied animal husbandry in school so she could take over the family business of sheep farming.
  - With many years of husbandry experience to his credit, Dr. Marks is viewed as an expert on the subject of breeding cattle.
  - If you do not plant your crops on fertile soil, your efforts in husbandry will be futile.
  - During my week on a pig farm, I learned about every aspect of husbandry from producing crops to caring for animals.
  - Technological tools such as mechanical vegetable pickers have greatly changed the way husbandry is conducted.
  - Although Bill has always wanted to be a horse breeder, he chose a major in business instead of husbandry.



#+HTML: <a id="bottom"/>
#+HTML: <a href="#top">⇧</a>