ruby/H.html



<div id="outline-container-org252f7f4" class="outline-2">
<h2 id="org252f7f4"><span class="section-number-2">59</span> <a href="https://wordsinasentence.com/homely-in-a-sentence/">Homely</a></h2>
<div class="outline-text-2" id="text-59">
<p>
<code>unattractive and plain in appearance</code>
</p>

<ul class="org-ul">
<li>The homely girl’s classmates thought she needed a makeover to make her more attractive.</li>
<li>Homely and plain, the woman was known for her delicious cooking but not her looks.</li>
<li>If modest Martha would put on makeup and a party dress, he might appear less homely.</li>
<li>Embarrassed by her homely appearance, Lily tried to make herself appear less attractive.</li>
</ul>
</div>
</div>



<div id="outline-container-org9dca9d1" class="outline-2">
<h2 id="org9dca9d1"><span class="section-number-2">60</span> <a href="https://wordsinasentence.com/hone-in-a-sentence/">Hone</a></h2>
<div class="outline-text-2" id="text-60">
<p>
<code>to perfect a talent or skill</code>
</p>

<ul class="org-ul">
<li>The tennis player practices several hours a day to hone her skills.</li>
<li>Because Jessica wants to hone her cake baking ability, she can usually be found in the kitchen.</li>
<li>The apprentice will hone his mechanical expertise under a mentor and then open his own garage.</li>
<li>To stand a chance at winning the ice sculpting contest, Mark will need to hone his carving skills.</li>
</ul>
</div>
</div>



<div id="outline-container-org5fd1c14" class="outline-2">
<h2 id="org5fd1c14"><span class="section-number-2">61</span> <a href="https://wordsinasentence.com/hoodwink-in-a-sentence/">Hoodwink</a></h2>
<div class="outline-text-2" id="text-61">
<p>
<code>to trick or deceive someone</code>
</p>

<ul class="org-ul">
<li>In an attempt to hoodwink the woman into opening the front door, the rapist pretended to be a police officer.</li>
<li>Car dealerships often hoodwink customers into coming to their lots by making promises of incredibly low payments.</li>
<li>In the shady bar, the bartender is known for trying to hoodwink customers by passing off cheap whiskey as a premium brand.</li>
<li>The con artist was arrested when he tried to hoodwink the undercover police officer.</li>
<li>Since Jed does not want a bachelor party, it is my job to hoodwink him into attending the celebration I have secretly planned.</li>
<li>Stores hoodwink customers by increasing prices on items and then offering special discounts on the same products.</li>
<li>As Patrick read the suspicious email, he realized someone was trying to hoodwink him into sharing his financial information.</li>
</ul>
</div>
</div>



<div id="outline-container-org4739f97" class="outline-2">
<h2 id="org4739f97"><span class="section-number-2">62</span> <a href="https://wordsinasentence.com/horrendous-in-a-sentence/">Horrendous</a></h2>
<div class="outline-text-2" id="text-62">
<p>
<code>horrific; terrible</code>
</p>

<ul class="org-ul">
<li>The villagers were shocked that a boy so young could commit such a horrendous crime with no regard for human life.</li>
<li>At the site of the horrendous traffic accident, people rushed to help free the children from the burning bus.</li>
<li>The state of the rental house was horrendous, with the previous renters having completely destroyed the property.</li>
<li>Life in the poverty-stricken city is horrendous since most people there are living in terrible conditions without food or water.</li>
</ul>
</div>
</div>



<div id="outline-container-org33435d3" class="outline-2">
<h2 id="org33435d3"><span class="section-number-2">63</span> <a href="https://wordsinasentence.com/horticulture-in-a-sentence/">Horticulture</a></h2>
<div class="outline-text-2" id="text-63">
<p>
<code>the science of caring for gardens; gardening</code>
</p>

<ul class="org-ul">
<li>Bob enrolled in a class that teaches horticulture so that he can cultivate his garden.</li>
<li>Horticulture is an art that requires getting your hands dirty, although being able to create a great garden is very rewarding.</li>
<li>We are experiencing a drought which will have a lasting effect on the horticulture industry.</li>
<li>The government is offering incentives for people to take up horticulture in the hope that it will make our city more pretty than it already is.</li>
</ul>
</div>
</div>


<div id="outline-container-org02b2ddb" class="outline-2">
<h2 id="org02b2ddb"><span class="section-number-2">64</span> <a href="https://wordsinasentence.com/hubris-in-a-sentence/">Hubris</a></h2>
<div class="outline-text-2" id="text-64">
<p>
<code>an excess of confidence; having too much pride and personal worth</code>
</p>

<ul class="org-ul">
<li>The leader of the cult had so much hubris he believed the government would never be able to capture him.</li>
<li>Although the priest had taken a vow to help others, his own personal judgment was blinded by hubris.</li>
<li>Since Cynthia won the beauty pageant, she has allowed her hubris to turn into arrogance.</li>
<li>Most politicians are so inflated by their own hubris they cannot understand the needs of their communities.</li>
<li>Feeling unbeatable because of her hubris, Carolyn did not prepare well for the contest and lost.</li>
<li>Don’t let your hubris cost you friends!</li>
<li>Although Michael won over twenty Olympic medals, his hubris did not isolate him from the other athletes.</li>
</ul>
</div>
</div>



<div id="outline-container-org60acb16" class="outline-2">
<h2 id="org60acb16"><span class="section-number-2">65</span> <a href="https://wordsinasentence.com/hue-in-a-sentence/">Hue</a></h2>
<div class="outline-text-2" id="text-65">
<p>
<code>a shade of color</code>
</p>

<ul class="org-ul">
<li>Placing the cloth over the lamp produced a blue hue in our bedroom.</li>
<li>Can anyone tell me why there is a strange purple hue in the background of my pictures?</li>
<li>The pale hue of the patient’s skin was a sign of anemia.</li>
<li>As I stood on the balcony, I tried to take a photo of the hue of the setting sun.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb292541" class="outline-2">
<h2 id="orgb292541"><span class="section-number-2">66</span> <a href="https://wordsinasentence.com/hurtle-in-a-sentence/">Hurtle</a></h2>
<div class="outline-text-2" id="text-66">
<p>
<code>move at a rapid pace in a wild manner</code>
</p>

<ul class="org-ul">
<li>The force of the truck caused the car to hurtle over the bridge.</li>
<li>If you live in a trailer, you should evacuate at once because the hurricane could cause your home  to hurtle through the air.</li>
<li>Throwing the glass vase against the wall will cause pieces of it to hurtle in random directions.</li>
<li>Even under the pilot’s control, the damaged plane seemed to hurtle towards the runway.</li>
</ul>
</div>
</div>



<div id="outline-container-org65a8229" class="outline-2">
<h2 id="org65a8229"><span class="section-number-2">67</span> <a href="https://wordsinasentence.com/husbandry-in-a-sentence/">Husbandry</a></h2>
<div class="outline-text-2" id="text-67">
<p>
<code>the breeding and/or cultivation of animals and/or crops</code>
</p>

<ul class="org-ul">
<li>Because we engage in husbandry and produce our own food, we do not have huge grocery store bills.</li>
<li>Elena studied animal husbandry in school so she could take over the family business of sheep farming.</li>
<li>With many years of husbandry experience to his credit, Dr. Marks is viewed as an expert on the subject of breeding cattle.</li>
<li>If you do not plant your crops on fertile soil, your efforts in husbandry will be futile.</li>
<li>During my week on a pig farm, I learned about every aspect of husbandry from producing crops to caring for animals.</li>
<li>Technological tools such as mechanical vegetable pickers have greatly changed the way husbandry is conducted.</li>
<li>Although Bill has always wanted to be a horse breeder, he chose a major in business instead of husbandry.</li>
</ul>



<a id="bottom"/>
<a href="#top">⇧</a>
</div>
</div>
</div>
</body>
</html>